import pandas as pd
df = pd.read_excel('sangyoi_health_checkup.xlsx')
print(df)

print(df.info())
print(df.describe())
print(df.shape)

print(df[["受診者名","受診者カナ","生年月日","年齢","血圧１回目(最高):結果","血圧１回目(最低):結果","ＡＳＴ(ＧＯＴ):結果","ＡＬＴ(ＧＰＴ):結果","ＬＤＬコレステロール:結果","中性脂肪:結果","ＨｂＡ１ｃ(ＮＧＳＰ):結果","空腹時血糖:結果","クレアチニン:結果"]])



print(df[df["中性脂肪:結果"]>=500])
print(df[df["ＨｂＡ１ｃ(ＮＧＳＰ):結果"]>=10])
print(df[df["空腹時血糖:結果"]>=200])

print(df["中性脂肪:結果"]>=500)
print(df["ＨｂＡ１ｃ(ＮＧＳＰ):結果"]>=10)
print(df["空腹時血糖:結果"]>=200)

df1=df[(df["中性脂肪:結果"]>=500)|(df["ＨｂＡ１ｃ(ＮＧＳＰ):結果"]>=10)|(df["空腹時血糖:結果"]>=200)]

print(df1[["受診者名","受診者カナ","生年月日","年齢","中性脂肪:結果","ＨｂＡ１ｃ(ＮＧＳＰ):結果","空腹時血糖:結果"]])

df2=df1[["受診者名","受診者カナ","生年月日","年齢","中性脂肪:結果","ＨｂＡ１ｃ(ＮＧＳＰ):結果","空腹時血糖:結果"]]


df2.to_csv("kadai2_1.csv",index=None)

